{
  "softwareProjects": [
    {
      "ProjectTitle": "Delivery Cost Calculator",
      "ProjectDescription": "This is a Windows desktop application developed for my HNC software development coursework. The goal was to create a simple yet functional tool that calculates the cost of a delivery based on distance. The cost formula is straightforward: £3 per mile plus a fixed £2 booking fee. The application includes a user-friendly interface built with C# using Windows Forms, where users can input the distance to get a real-time cost estimate. Behind the scenes, the app communicates with a lightweight REST API developed in JavaScript, which performs the calculation and returns the result. This project taught me the fundamentals of frontend-to-backend integration, form validation, and how to structure basic API logic.",
      "ProjectImage": "./images/OrderApp.png",
      "ProjectURL": "https://github.com/fazemodz/orderapp2",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/orderapp2"
    }
  ],
  "webProjects": [
    {
      "ProjectTitle": "Blackhole Exploration",
      "ProjectDescription": "This project involved creating a promotional website for a fictional conference on space exploration, specifically focusing on black holes. The website was built using Vite for fast development and React.js for building dynamic, component-based UIs. One of the key challenges I faced was optimizing the user interface for both desktop and mobile devices, ensuring it was responsive and visually appealing. I also had to learn how to integrate and manage assets like images and videos while keeping load times minimal. This project provided hands-on experience in frontend development and taught me valuable lessons in creating accessible and performant websites. It's a prime example of how a simple concept (conference advertising) can be elevated with modern web technologies.",
      "ProjectImage": "./images/BlackholeExploraion.png",
      "ProjectURL": "https://blackhole-exploration.projectredacted.org/",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/blackhole-exploration"
    },
    {
      "ProjectTitle": "YouTube Search API Project",
      "ProjectDescription": "For my first full-fledged React.js project, I built an app that allows users to search for YouTube videos and retrieve detailed information about both the videos and the associated channels. This project utilized the YouTube Data API to fetch data and display it dynamically. I faced the challenge of managing asynchronous data fetching while ensuring the UI remained responsive and user-friendly. The original version of this project required two separate domains—one for the frontend and one for the API—which introduced additional complexity in handling cross-origin requests and managing session states. The project is currently being refactored in Next.js for better performance, easier server-side rendering, and simplified domain management. This project taught me the importance of API integration, state management, and how to improve user experience through real-time data updates.",
      "ProjectImage": "./images/YTSearchProjectOld.png",
      "ProjectURL": "https://youtube-video-tool-rewrite.vercel.app/M2WTUoy4y6E",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/youtube-video-tool-rewrite"
    }, 
     {
      "ProjectTitle": "My portfolio",
      "ProjectDescription": "This is my portfolio website, it was built using Next.js and Tailwind CSS. It's a simple website that displays my projects and my skills.",
      "ProjectImage": "./images/Portfolio.png",
      "ProjectURL": "https://projectredacted.org",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/portfolio-main"
    },
    {
      "ProjectTitle": "YouTube Search API Project Reworked",
      "ProjectDescription": "I decided to refactor the YouTube Search API Project to use Next.js for better performance, easier server-side rendering, and simplified domain management. This project taught me the importance of API integration, state management, and how to improve user experience through real-time data updates.",
      "ProjectImage": "./images/YTSeachProject.png",
      "ProjectURL": "https://youtubevideosearchfrontend.projectredacted.org/",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/youtube-search-api"
    }
  ],
  "gameProjects": [
    {
      "ProjectTitle": "Doyag",
      "ProjectDescription": "A fast-paced platform jumper built in Unreal Engine 5 over the course of one week for a work event. The game features responsive movement through Unreal’s animation matching system and offers three levels—Tutorial, Hard, and Extreme—to provide a clear progression of challenge. The project focused on delivering smooth character control, concise level design, and replayable difficulty modes within a short development timeframe. This game was put out on itch.io and got a lot of positive feedback from the community.",
      "ProjectImage": "./images/Doyag.png",
      "ProjectURL": "https://littlemouseaddie.itch.io/doyag",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/DeathJump-Prototype/tree/main/game%20file"
    }
  ]
}
