{
  "softwareProjects": [
    {
      "ProjectTitle": "Delivery Cost Calculator",
      "ProjectDescription": "This is a Windows desktop application developed for my HNC software development coursework. The goal was to create a simple yet functional tool that calculates the cost of a delivery based on distance. The cost formula is straightforward: £3 per mile plus a fixed £2 booking fee. The application includes a user-friendly interface built with C# using Windows Forms, where users can input the distance to get a real-time cost estimate. Behind the scenes, the app communicates with a lightweight REST API developed in JavaScript, which performs the calculation and returns the result. This project taught me the fundamentals of frontend-to-backend integration, form validation, and how to structure basic API logic.",
      "ProjectImage": "./images/OrderApp.png",
      "ProjectURL": "https://github.com/fazemodz/orderapp2",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/orderapp2"
    }
  ],
  "webProjects": [
    {
      "ProjectTitle": "Blackhole Exploration",
      "ProjectDescription": "This project involved creating a promotional website for a fictional conference on space exploration, specifically focusing on black holes. The website was built using Vite for fast development and React.js for building dynamic, component-based UIs. One of the key challenges I faced was optimizing the user interface for both desktop and mobile devices, ensuring it was responsive and visually appealing. I also had to learn how to integrate and manage assets like images and videos while keeping load times minimal. This project provided hands-on experience in frontend development and taught me valuable lessons in creating accessible and performant websites. It's a prime example of how a simple concept (conference advertising) can be elevated with modern web technologies.",
      "ProjectImage": "./images/BlackholeExploraion.png",
      "ProjectURL": "https://blackhole-exploration.projectredacted.org/",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/blackhole-exploration"
    },
    {
      "ProjectTitle": "YouTube Search API Project",
      "ProjectDescription": "For my first full-fledged React.js project, I built an app that allows users to search for YouTube videos and retrieve detailed information about both the videos and the associated channels. This project utilized the YouTube Data API to fetch data and display it dynamically. I faced the challenge of managing asynchronous data fetching while ensuring the UI remained responsive and user-friendly. The original version of this project required two separate domains—one for the frontend and one for the API—which introduced additional complexity in handling cross-origin requests and managing session states. The project is currently being refactored in Next.js for better performance, easier server-side rendering, and simplified domain management. This project taught me the importance of API integration, state management, and how to improve user experience through real-time data updates.",
      "ProjectImage": "./images/YTSearchProjectOld.png",
      "ProjectURL": "https://youtubevideosearchfrontend.projectredacted.org/",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/youtube-search-api"
    }
  ],
  "gameProjects": [
    {
      "ProjectTitle": "Rocket Game (WIP)",
      "ProjectDescription": "A 2D physics-based rocket game in Unity. Tow boulders using tethers, manage limited fuel, and dodge obstacles. Work in progress with gameplay refinement ongoing. The game aims to combine fun physics-based mechanics with challenging obstacles, creating an engaging experience. The game includes features like tethering mechanics, fuel management, and obstacle navigation, all enhanced with realistic physics for better gameplay interaction.",
      "ProjectImage": "./images/RocketGame.png",
      "ProjectURL": "https://github.com/fazemodz/rocketgame",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/rocketgame"
    },
    {
      "ProjectTitle": "VR Shooter (CW2)",
      "ProjectDescription": "A VR shooter inspired by Pavlov VR. Created for a university coursework project in Unity with full VR interactions and mechanics. The game focuses on offering a realistic VR shooting experience, where users can interact with their environment using motion controllers. The main goal was to replicate a real-life shooting experience with dynamic environments and multiplayer support in Unity. This project helped me learn how to implement VR mechanics such as hand-tracking, gun mechanics, and player movement within Unity and the SteamVR SDK.",
      "ProjectImage": "./images/VRGame.png",
      "ProjectURL": "https://github.com/fazemodz/vrshooter",
      "ProjectSourceCodeURL": "https://github.com/fazemodz/vrshooter"
    }
  ]
}
